# Data Cleaning

In [1]:
import pandas as pd

Pandas:
- Series
- Dataframe

In [ ]:
# Series
x = [2,4,6,8,0]

series = pd.Series(x)
series

0    2
1    4
2    6
3    8
4    0
dtype: int64

In [ ]:
# Dataframe
data = {
    'name': ['Viola', 'Jess', 'Dan'],
    'age': [30,31,29]
}

df = pd.DataFrame(data)
df

    name  age
0  Viola   30
1   Jess   31
2    Dan   29

In [83]:
df.loc[df['name']=='Viola'] # Show all records where name is Viola

df.loc[(df['name']=='Viola') & (df['age']>20)] # Show all records where name is Viola and age is greater than 20

    name  age
0  Viola   30

REMEMBER for filtering:
- df.loc[ROWS,COLS]
- : means everything

In [ ]:
# Add new column to dataframe
df['new_col'] = 2
df

    name  age  new_col
0  Viola   30        2
1   Jess   31        2
2    Dan   29        2

## Book Data

In [ ]:
# Import Book data into a Pandas dataframe
book_dataframe = pd.read_csv("./sample_data/03_Library Systembook.csv")
book_dataframe.head(50)

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,"""20/02/2023""",25/02/2023,2 weeks,1.0
1,2.0,Lord of the rings the two towers,"""24/03/2023""",21/03/2023,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,"""29/03/2023""",25/03/2023,2 weeks,3.0
3,4.0,The hobbit,"""02/04/2023""",25/03/2023,2 weeks,4.0
4,5.0,Dune,"""02/04/2023""",25/03/2023,2 weeks,5.0
5,6.0,Little Women,"""02/04/2023""",01/05/2023,2 weeks,1.0
6,7.0,IT,"""10/04/2063""",03/04/2023,2 weeks,6.0
7,8.0,Misery,"""15/04/2023""",03/04/2023,2 weeks,7.0
8,9.0,Catch 22,"""15/04/2023""",16/04/2023,2 weeks,7.0
9,10.0,Animal Farm,"""20/04/2023""",24/04/2023,2 weeks,2.0
10,11.0,1984,"""23/04/2023""",27/04/2023,2 weeks,8.0
11,12.0,Little Women,"""02/04/2023""",01/05/2023,2 weeks,1.0
12,13.0,East of Eden,"""30/04/2023""",05/05/2023,2 weeks,2.0
13,14.0,America Is in the Heart,"""01/05/2023""",07/05/2023,2 weeks,3.0
14,15.0,Wuthering Heights,"""01/05/2023""",10/05/2023,2 weeks,9.0
15,16.0,Dark Tales,"""15/05/2023""",01/06/2023,2 weeks,2.0
16,17.0,The Bloody Chamber,"""32/05/2023""",04/06/2023,2 weeks,3.0
17,18.0,Les Miserables,"""03/06/2023""",07/06/2023,2 weeks,5.0
18,19.0,Dracula,"""10/06/2023""",10/07/2023,2 weeks,10.0
19,20.0,Frankenstein,"""01/06/2023""",20/06/2023,2 weeks,2.0
20,21.0,NaN,"""01/06/2023""",05/06/2023,2 weeks,NaN
21,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,NaN,NaN,NaN,NaN
24,NaN,NaN,NaN,NaN,NaN,NaN
25,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN
27,NaN,NaN,NaN,NaN,NaN,NaN
28,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN
30,NaN,NaN,NaN,NaN,NaN,NaN
31,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,NaN,NaN,NaN,NaN,NaN
33,NaN,NaN,NaN,NaN,NaN,NaN
34,NaN,NaN,NaN,NaN,NaN,NaN
35,NaN,NaN,NaN,NaN,NaN,NaN
36,NaN,NaN,NaN,NaN,NaN,NaN
37,NaN,NaN,NaN,NaN,NaN,NaN
38,NaN,NaN,NaN,NaN,NaN,NaN
39,NaN,NaN,NaN,NaN,NaN,NaN
40,NaN,NaN,NaN,NaN,NaN,NaN
41,NaN,NaN,NaN,NaN,NaN,NaN
42,NaN,NaN,NaN,NaN,NaN,NaN
43,NaN,NaN,NaN,NaN,NaN,NaN
44,NaN,NaN,NaN,NaN,NaN,NaN
45,NaN,NaN,NaN,NaN,NaN,NaN
46,NaN,NaN,NaN,NaN,NaN,NaN
47,NaN,NaN,NaN,NaN,NaN,NaN
48,NaN,NaN,NaN,NaN,NaN,NaN
49,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
# Review Book data
book_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Id                      21 non-null     float64
 1   Books                   20 non-null     object
 2   Book checkout           21 non-null     object
 3   Book Returned           21 non-null     object
 4   Days allowed to borrow  21 non-null     object
 5   Customer ID             20 non-null     float64
dtypes: float64(2), object(4)
memory usage: 5.5+ KB

In [5]:
# Remove columns with missing Id or Book name
book_df = book_dataframe.dropna(subset=["Id","Books"])
book_df

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,"""20/02/2023""",25/02/2023,2 weeks,1.0
1,2.0,Lord of the rings the two towers,"""24/03/2023""",21/03/2023,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,"""29/03/2023""",25/03/2023,2 weeks,3.0
3,4.0,The hobbit,"""02/04/2023""",25/03/2023,2 weeks,4.0
4,5.0,Dune,"""02/04/2023""",25/03/2023,2 weeks,5.0
5,6.0,Little Women,"""02/04/2023""",01/05/2023,2 weeks,1.0
6,7.0,IT,"""10/04/2063""",03/04/2023,2 weeks,6.0
7,8.0,Misery,"""15/04/2023""",03/04/2023,2 weeks,7.0
8,9.0,Catch 22,"""15/04/2023""",16/04/2023,2 weeks,7.0
9,10.0,Animal Farm,"""20/04/2023""",24/04/2023,2 weeks,2.0
10,11.0,1984,"""23/04/2023""",27/04/2023,2 weeks,8.0
11,12.0,Little Women,"""02/04/2023""",01/05/2023,2 weeks,1.0
12,13.0,East of Eden,"""30/04/2023""",05/05/2023,2 weeks,2.0
13,14.0,America Is in the Heart,"""01/05/2023""",07/05/2023,2 weeks,3.0
14,15.0,Wuthering Heights,"""01/05/2023""",10/05/2023,2 weeks,9.0
15,16.0,Dark Tales,"""15/05/2023""",01/06/2023,2 weeks,2.0
16,17.0,The Bloody Chamber,"""32/05/2023""",04/06/2023,2 weeks,3.0
17,18.0,Les Miserables,"""03/06/2023""",07/06/2023,2 weeks,5.0
18,19.0,Dracula,"""10/06/2023""",10/07/2023,2 weeks,10.0
19,20.0,Frankenstein,"""01/06/2023""",20/06/2023,2 weeks,2.0

In [6]:
# Check data types
book_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Id                      20 non-null     float64
 1   Books                   20 non-null     object
 2   Book checkout           20 non-null     object
 3   Book Returned           20 non-null     object
 4   Days allowed to borrow  20 non-null     object
 5   Customer ID             20 non-null     float64
dtypes: float64(2), object(4)
memory usage: 1.1+ KB

In [7]:
# Convert Book Returned column to date
book_df.loc[:, "Book Returned"] = pd.to_datetime(book_df["Book Returned"])
book_df["Book Returned"].dtype

C:\Users\Admin\AppData\Local\Temp\ipykernel_13888\1533216223.py:2: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  book_df.loc[:, "Book Returned"] = pd.to_datetime(book_df["Book Returned"])

dtype('O')

In [8]:
# Remove double quotes around the Book checkout dates
book_df.loc[:, "Book checkout"] = book_df["Book checkout"].str.strip('"')

# Update Book checkout date for Book checkout is 32/05/2023
book_df.loc[book_df["Book checkout"] == "32/05/2023", "Book checkout"] = "31/05/2023"
book_df[book_df["Book checkout"] == "32/05/2023"]

Empty DataFrame
Columns: [Id, Books, Book checkout, Book Returned, Days allowed to borrow, Customer ID]
Index: []

In [9]:
# Convert Book chceckout column to date
book_df["Book checkout"] = pd.to_datetime(book_df["Book checkout"], format="%d/%m/%Y")
# book_df.loc[:, "Book checkout"] = pd.to_datetime(book_df["Book checkout"], format="%d/%m/%Y")
book_df["Book checkout"].dtype
# book_df

C:\Users\Admin\AppData\Local\Temp\ipykernel_13888\2348628096.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  book_df["Book checkout"] = pd.to_datetime(book_df["Book checkout"], format="%d/%m/%Y")

dtype('<M8[ns]')

In [10]:
# Convert Book Returned column to date
book_df["Book Returned"] = pd.to_datetime(book_df["Book Returned"], format="%d/%m/%Y")
# book_df.loc[:, "Book Returned"] = pd.to_datetime(book_df["Book Returned"], format="%d/%m/%Y")
book_df["Book Returned"].dtype
# book_df

C:\Users\Admin\AppData\Local\Temp\ipykernel_13888\2047718455.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  book_df["Book Returned"] = pd.to_datetime(book_df["Book Returned"], format="%d/%m/%Y")

dtype('<M8[ns]')

In [11]:
# Remove time and keep date only
book_df.loc[:, "Book checkout"] = pd.to_datetime(book_df["Book checkout"]).dt.date
book_df.loc[:, "Book Returned"] = pd.to_datetime(book_df["Book Returned"]).dt.date
book_df

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,2023-02-20,2023-02-25,2 weeks,1.0
1,2.0,Lord of the rings the two towers,2023-03-24,2023-03-21,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,2023-03-29,2023-03-25,2 weeks,3.0
3,4.0,The hobbit,2023-04-02,2023-03-25,2 weeks,4.0
4,5.0,Dune,2023-04-02,2023-03-25,2 weeks,5.0
5,6.0,Little Women,2023-04-02,2023-05-01,2 weeks,1.0
6,7.0,IT,2063-04-10,2023-04-03,2 weeks,6.0
7,8.0,Misery,2023-04-15,2023-04-03,2 weeks,7.0
8,9.0,Catch 22,2023-04-15,2023-04-16,2 weeks,7.0
9,10.0,Animal Farm,2023-04-20,2023-04-24,2 weeks,2.0
10,11.0,1984,2023-04-23,2023-04-27,2 weeks,8.0
11,12.0,Little Women,2023-04-02,2023-05-01,2 weeks,1.0
12,13.0,East of Eden,2023-04-30,2023-05-05,2 weeks,2.0
13,14.0,America Is in the Heart,2023-05-01,2023-05-07,2 weeks,3.0
14,15.0,Wuthering Heights,2023-05-01,2023-05-10,2 weeks,9.0
15,16.0,Dark Tales,2023-05-15,2023-06-01,2 weeks,2.0
16,17.0,The Bloody Chamber,2023-05-31,2023-06-04,2 weeks,3.0
17,18.0,Les Miserables,2023-06-03,2023-06-07,2 weeks,5.0
18,19.0,Dracula,2023-06-10,2023-07-10,2 weeks,10.0
19,20.0,Frankenstein,2023-06-01,2023-06-20,2 weeks,2.0

In [12]:
# Find duplicate records
book_df[book_df.duplicated(subset=["Books"], keep=False)]

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
5,6.0,Little Women,2023-04-02,2023-05-01,2 weeks,1.0
11,12.0,Little Women,2023-04-02,2023-05-01,2 weeks,1.0

In [13]:
# Drop duplicate records
book_df = book_df.drop_duplicates(subset=["Books"])

In [ ]:
# Convert float id values to int
# book_df.loc[:, ["Id", "Customer ID"]] = book_df[["Id", "Customer ID"]].astype("Int64")    # Didn't work

# book_df["Customer ID"] = book_df[["Customer ID"]].astype("Int64")     # Run this first
# book_df.loc[:, ["Customer ID"]] = book_df[["Customer ID"]].astype("Int64")    # Run this second
# book_df["Id"] = book_df[["Id"]].astype("Int64")     # Run this first 
# book_df.loc[:, ["Id"]] = book_df[["Id"]].astype("Int64")  # Run this second

In [14]:
book_df

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,2023-02-20,2023-02-25,2 weeks,1.0
1,2.0,Lord of the rings the two towers,2023-03-24,2023-03-21,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,2023-03-29,2023-03-25,2 weeks,3.0
3,4.0,The hobbit,2023-04-02,2023-03-25,2 weeks,4.0
4,5.0,Dune,2023-04-02,2023-03-25,2 weeks,5.0
5,6.0,Little Women,2023-04-02,2023-05-01,2 weeks,1.0
6,7.0,IT,2063-04-10,2023-04-03,2 weeks,6.0
7,8.0,Misery,2023-04-15,2023-04-03,2 weeks,7.0
8,9.0,Catch 22,2023-04-15,2023-04-16,2 weeks,7.0
9,10.0,Animal Farm,2023-04-20,2023-04-24,2 weeks,2.0
10,11.0,1984,2023-04-23,2023-04-27,2 weeks,8.0
12,13.0,East of Eden,2023-04-30,2023-05-05,2 weeks,2.0
13,14.0,America Is in the Heart,2023-05-01,2023-05-07,2 weeks,3.0
14,15.0,Wuthering Heights,2023-05-01,2023-05-10,2 weeks,9.0
15,16.0,Dark Tales,2023-05-15,2023-06-01,2 weeks,2.0
16,17.0,The Bloody Chamber,2023-05-31,2023-06-04,2 weeks,3.0
17,18.0,Les Miserables,2023-06-03,2023-06-07,2 weeks,5.0
18,19.0,Dracula,2023-06-10,2023-07-10,2 weeks,10.0
19,20.0,Frankenstein,2023-06-01,2023-06-20,2 weeks,2.0

In [15]:
book_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19 entries, 0 to 19
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Id                      19 non-null     float64
 1   Books                   19 non-null     object
 2   Book checkout           19 non-null     datetime64[ns]
 3   Book Returned           19 non-null     datetime64[ns]
 4   Days allowed to borrow  19 non-null     object
 5   Customer ID             19 non-null     float64
dtypes: datetime64[ns](2), float64(2), object(2)
memory usage: 1.0+ KB

In [22]:
book_df.loc[book_df['Id']==1, 'Book checkout']

0   2023-02-20
Name: Book checkout, dtype: datetime64[ns]

In [ ]:
# Function to find how long a book was on loan
def loan_duration(df):
    return df['Book Returned'] - df['Book checkout']

loan_duration(df=book_df)

0         5 days
1        -3 days
2        -4 days
3        -8 days
4        -8 days
5        29 days
6    -14617 days
7       -12 days
8         1 days
9         4 days
10        4 days
12        5 days
13        6 days
14        9 days
15       17 days
16        4 days
17        4 days
18       30 days
19       19 days
dtype: timedelta64[ns]

In [23]:
# Add new column to book dataframe
book_df['Loan duration'] = loan_duration(df=book_df)
book_df

C:\Users\Admin\AppData\Local\Temp\ipykernel_13888\1236346354.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  book_df['Loan duration'] = loan_duration(df=book_df)

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID,Loan duration
0,1.0,Catcher in the Rye,2023-02-20,2023-02-25,2 weeks,1.0,5 days
1,2.0,Lord of the rings the two towers,2023-03-24,2023-03-21,2 weeks,2.0,-3 days
2,3.0,Lord of the rings the return of the kind,2023-03-29,2023-03-25,2 weeks,3.0,-4 days
3,4.0,The hobbit,2023-04-02,2023-03-25,2 weeks,4.0,-8 days
4,5.0,Dune,2023-04-02,2023-03-25,2 weeks,5.0,-8 days
5,6.0,Little Women,2023-04-02,2023-05-01,2 weeks,1.0,29 days
6,7.0,IT,2063-04-10,2023-04-03,2 weeks,6.0,-14617 days
7,8.0,Misery,2023-04-15,2023-04-03,2 weeks,7.0,-12 days
8,9.0,Catch 22,2023-04-15,2023-04-16,2 weeks,7.0,1 days
9,10.0,Animal Farm,2023-04-20,2023-04-24,2 weeks,2.0,4 days
10,11.0,1984,2023-04-23,2023-04-27,2 weeks,8.0,4 days
12,13.0,East of Eden,2023-04-30,2023-05-05,2 weeks,2.0,5 days
13,14.0,America Is in the Heart,2023-05-01,2023-05-07,2 weeks,3.0,6 days
14,15.0,Wuthering Heights,2023-05-01,2023-05-10,2 weeks,9.0,9 days
15,16.0,Dark Tales,2023-05-15,2023-06-01,2 weeks,2.0,17 days
16,17.0,The Bloody Chamber,2023-05-31,2023-06-04,2 weeks,3.0,4 days
17,18.0,Les Miserables,2023-06-03,2023-06-07,2 weeks,5.0,4 days
18,19.0,Dracula,2023-06-10,2023-07-10,2 weeks,10.0,30 days
19,20.0,Frankenstein,2023-06-01,2023-06-20,2 weeks,2.0,19 days

## Customer Data

In [ ]:
# Import Customers data into a Pandas dataframe
customers_dataframe = pd.read_csv("./sample_data/03_Library Systemcustomers.csv")
customers_dataframe

   Customer ID     Customer Name
0          1.0          Jane Doe
1          2.0        John Smith
2          3.0        Dan Reeves
3          NaN               NaN
4          5.0    William Holden
5          6.0     Jaztyn Forest
6          7.0     Jackie Irving
7          8.0  Matthew Stirling
8          9.0         Emory Ted

In [146]:
# Review Customers data types
customers_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer ID    8 non-null      float64
 1   Customer Name  8 non-null      object
dtypes: float64(1), object(1)
memory usage: 276.0+ bytes

In [147]:
# Drop null values
customers_df = customers_dataframe.dropna(subset=["Customer ID"])
customers_df

   Customer ID     Customer Name
0          1.0          Jane Doe
1          2.0        John Smith
2          3.0        Dan Reeves
4          5.0    William Holden
5          6.0     Jaztyn Forest
6          7.0     Jackie Irving
7          8.0  Matthew Stirling
8          9.0         Emory Ted

In [150]:
# Convert float Customer id values to int
customers_df["Customer ID"] = customers_df[["Customer ID"]].astype("Int64")
customers_df.loc[:, ["Customer ID"]] = customers_df[["Customer ID"]].astype("Int64")

C:\Users\Admin\AppData\Local\Temp\ipykernel_13160\1894066754.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers_df["Customer ID"] = customers_df[["Customer ID"]].astype("Int64")

In [151]:
customers_df

   Customer ID     Customer Name
0            1          Jane Doe
1            2        John Smith
2            3        Dan Reeves
4            5    William Holden
5            6     Jaztyn Forest
6            7     Jackie Irving
7            8  Matthew Stirling
8            9         Emory Ted

In [152]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 8
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer ID    8 non-null      Int64
 1   Customer Name  8 non-null      object
dtypes: Int64(1), object(1)
memory usage: 200.0+ bytes

## Load cleaned data into new csv files

In [ ]:
book_df.to_csv("./cleaned_data/03_Library Systembook_cleaned.csv", index=False)

In [ ]:
customers_df.to_csv("./cleaned_data/03_Library Systemcustomers_cleaned.csv", index=False)